# 0. Import libraries/packages

In [1]:
import pandas as pd

# 1. Data Exploration

## 1.1 Card Activations

In [2]:
card_activation = pd.read_csv('data/CardActivation.csv', sep =';')

In [3]:
card_activation.head()

,CardId,CardMaskedNumber,CardStatus,CardHolderName,CardHolderEmail,CardActivationDate,CardProductCode,NetworkCode,WalletId
0,472551A1-5213-4634-910F-0936078BBE4A,537489XXXXXX9155,Active,MIXXXXES,MIXX@XX.com,2019-01-17,GBC,MDT,1555075
1,88D46C5C-FD06-4AD9-9B3E-1F2F908034F7,537489XXXXXX2000,Active,NOXXXXAN,NOXX@XX.com,2019-01-15,GBC,MDT,7737229
2,6AC95B5C-D2F5-4259-865F-044993CBAA55,537489XXXXXX1609,Active,BAXXXXOS,anXX@XX.com,2019-04-08,BEC,MDT,1460308
3,015BE955-B53C-44CB-B73A-00DE3AAB7E7D,537489XXXXXX1903,Active,HOXXXXTS,HOXX@XX.com,2018-08-12,BEC,MDT,1604676
4,810C5A20-547B-41F0-8CC4-13178A343D6F,537489XXXXXX8913,Active,KOXXXXKS,suXX@XX.com,2019-03-14,GBC,MDT,1600748

In [4]:
card_activation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1760 entries, 0 to 1759
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CardId              1760 non-null   object
 1   CardMaskedNumber    1760 non-null   object
 2   CardStatus          1760 non-null   object
 3   CardHolderName      1760 non-null   object
 4   CardHolderEmail     1760 non-null   object
 5   CardActivationDate  1760 non-null   object
 6   CardProductCode     1760 non-null   object
 7   NetworkCode         1760 non-null   object
 8   WalletId            1760 non-null   int64
dtypes: int64(1), object(8)
memory usage: 123.9+ KB

## 1.2 Card Requests

In [5]:
card_request = pd.read_csv('data/CardRequest.csv', sep = ';')

In [6]:
card_request.head()

,CardRequestId,TypeId,TrackingNumber,ReferenceNumber,Sex,FirstName,LastOrBusinessName,City,PostalCode,AddressLine1,EmbossName,Sent,Track1Name,CountryCode,PriorityType,TargetSet
0,39618A71-A148-4E23-8F2B-2E10E810D5E2,2,668XXXX422,199XXXX603,M,YXXXXO,FUXXXXTD,London,UB6 9QU,594-598 Greenford Road 594-598,YAXXXXTD,2018-09-24 17:02:54.8880 +03:00,FUXXXXYO,GB,High,0
1,97737B32-AF22-43D9-99FD-0326E3075E14,2,616XXXX238,624XXXX333,M,AXXXXR,AMXXXXNE,Bruxelles,1050,Avenue Louise 149,ACXXXXNE,2019-01-28 17:00:05.9743 +02:00,AMXXXXUR,BE,High,2
2,5B5FEA6D-B5AE-4826-9A63-0679E536EC63,2,448XXXX873,572XXXX599,M,GXXXXS,BOXXXXNE,Norfolk Norwich,NR2 4TE,Heigham Street 4-6,GIXXXXNE,2019-01-30 17:00:38.2550 +02:00,BOXXXXES,GB,High,0
3,1B1C4B04-97D5-44E9-B006-028D87E05228,2,322XXXX921,382XXXX384,M,DXXXXY,THXXXXRY,Bruxelles,1000,RUE DES PIERRES 52 1000 BRUXELLES 52,DAXXXXRY,2018-10-12 17:00:39.8533 +03:00,THXXXXBY,BE,High,2
4,BD6429E9-CE61-47A0-8738-005377890285,2,269XXXX953,985XXXX578,M,VXXXXA,EDXXXXES,london,NW2 3RA,8 Minster Road,VIXXXXES,2019-04-22 17:00:13.3505 +03:00,EDXXXXMA,GB,OnHold,1

In [9]:
card_request.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1760 entries, 0 to 1759
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CardRequestId       1760 non-null   object
 1   TypeId              1760 non-null   int64
 2   TrackingNumber      1760 non-null   object
 3   ReferenceNumber     1760 non-null   object
 4   Sex                 1760 non-null   object
 5   FirstName           1760 non-null   object
 6   LastOrBusinessName  1760 non-null   object
 7   City                1760 non-null   object
 8   PostalCode          1760 non-null   object
 9   AddressLine1        1760 non-null   object
 10  EmbossName          1760 non-null   object
 11  Sent                1760 non-null   object
 12  Track1Name          1760 non-null   object
 13  CountryCode         1760 non-null   object
 14  PriorityType        1760 non-null   object
 15  TargetSet           1760 non-null   int64
dtypes: int64(2), object(14)
memory usage: 220.1+ KB

## 1.3 Card Transactions

In [7]:
card_transaction = pd.read_csv('data/CardTransaction.csv', sep = ';')

In [8]:
card_transaction.head()

,TransactionId,TransactionTypeId,TransactionDate,Currency,Channel,Status,Amount,CardAcceptorTerminalId,CardAcceptorDescription,CardAcceptorCountryId,CardAcceptorCategoryId,CardId,WalletId
0,89E96686-A69B-4B17-9B51-006194A974B9,0,2019-03-28 16:58:02.390,826,Card Present,Approved,6.50,67722256,iZ *Igloo Express LUTON GBR,826.0,5812.0,E18F0B23-F11E-4519-8999-DB6E9BC88BC0,9358132
1,C0247B84-C7C9-40B8-9AF2-001B6FFBCB4C,1,2019-04-25 00:56:44.020,826,Card Present,Approved,400.00,N236831,WATFORD TOWN CTR WATFORD GBR,826.0,6011.0,0791BD54-B2F5-4824-9088-C4D41B95B5B4,1888341
2,21342D07-1036-42C4-B55A-006B69CA0C8E,1,2019-01-16 23:16:00.917,826,Card Present,Approved,400.00,W0222Z,222 HIGH STREET LONDON GBR,826.0,6011.0,F4F5F549-A0E6-4C21-ACD6-C28E71FBBB42,1879253
3,5750E607-CB90-428F-BD75-001121B6BC94,0,2019-04-03 10:33:06.970,978,Card Not Present,Approved,20.21,WPGTID01,WWW.ALIEXPRESS.COM LONDON GBR,826.0,5964.0,C028AC17-7560-4BB7-9BF7-EF7AD99639F4,1748927
4,21BBFB4F-EA3D-4AA0-8C67-00517844A15C,0,2019-04-24 14:07:53.070,826,Card Present,Approved,4.75,36141602,SUPERSAVE FOOD AND WIN LONDON GBR,826.0,5411.0,E86C7D86-097C-4E44-A886-17D69A2A028F,4781689

In [10]:
card_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51199 entries, 0 to 51198
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   TransactionId            51199 non-null  object
 1   TransactionTypeId        51199 non-null  int64
 2   TransactionDate          51199 non-null  object
 3   Currency                 51199 non-null  int64
 4   Channel                  51199 non-null  object
 5   Status                   51199 non-null  object
 6   Amount                   51199 non-null  float64
 7   CardAcceptorTerminalId   49716 non-null  object
 8   CardAcceptorDescription  51197 non-null  object
 9   CardAcceptorCountryId    51153 non-null  float64
 10  CardAcceptorCategoryId   51153 non-null  float64
 11  CardId                   51199 non-null  object
 12  WalletId                 51199 non-null  int64
dtypes: float64(3), int64(3), object(7)
memory usage: 5.1+ MB

## 1.4 Country

In [11]:
country = pd.read_csv('data/Country.csv', sep = ';')

In [12]:
country.head()

   CountryId Code            Name
0          4   AF     AFGHANISTAN
1          8   AL         ALBANIA
2         12   DZ         ALGERIA
3         16   AS  AMERICAN SAMOA
4         20   AD         ANDORRA

In [13]:
country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211 entries, 0 to 210
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CountryId  211 non-null    int64
 1   Code       210 non-null    object
 2   Name       211 non-null    object
dtypes: int64(1), object(2)
memory usage: 5.1+ KB

## 1.5 Currency

In [14]:
currency = pd.read_csv('data/Currency.csv', sep = ';')

In [15]:
currency.head()

   Code Name           FullName
0     8  ALL       Albanian lek
1    12  DZD     Algerian dinar
2    32  ARS     Argentine peso
3    36  AUD  Australian dollar
4    44  BSD    Bahamian dollar

In [16]:
currency.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177 entries, 0 to 176
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Code      177 non-null    int64
 1   Name      177 non-null    object
 2   FullName  177 non-null    object
dtypes: int64(1), object(2)
memory usage: 4.3+ KB

## 1.6 Merchant Categories

In [19]:
merchant_categories = pd.read_csv('data/MerchantCategory.csv', sep = ';')

In [20]:
merchant_categories.head()

   Code                                        Description
0   742                                Veterinary Services
1   763                         Agricultural Co-operatives
2   780       Horticultural Services, Landscaping Services
3  1520     General Contractors-Residential and Commercial
4  1711  Air Conditioning Contractors – Sales and Insta...

In [21]:
merchant_categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 964 entries, 0 to 963
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Code         964 non-null    int64
 1   Description  964 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.2+ KB

## 1.7 Transaction Types

In [22]:
transaction_types = pd.read_csv('data/TransactionType.csv', sep = ';')

In [23]:
transaction_types.head()

   TransactionTypeId                     Name
0                  0                 Purchase
1                  1      ATM Cash Withdrawal
2                  9  Purchase with Cash Back
3                 12        Cash Disbursement
4                 18       Unique Transaction

In [24]:
transaction_types.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   TransactionTypeId  12 non-null     int64
 1   Name               12 non-null     object
dtypes: int64(1), object(1)
memory usage: 320.0+ bytes